aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c

/*
 * File:   main.c
 * Author: ICE_MEGANE
 *
 * Created on 2020/03/5, 22:26
 */

#include <xc.h>
#include "../userdefine.h"

#include "mcu_setup.h"

/* 関数プロトタイプ宣言 */
static void func_mset_s_option_reg_setup( void );
static void func_mset_s_oscillator_setup( void );
static void func_mset_s_pwr_save_setup( void );
static void func_mset_s_int_setup( void );
static void func_mset_s_port_setup( void );
static void func_mset_s_ioc_setup( void );
static void func_mset_s_pps_setup( void );


static void func_mset_s_adc_setup( void );


static void func_mset_s_ccp_setup( void );
static void func_mset_s_timer_setup( void );
static void func_mset_s_timer0_setup( void );
static void func_mset_s_timer2_setup( void );
static void func_mset_s_timer4_setup( void );
static void func_mset_s_timer6_setup( void );


/**************************************************************/
/*  Function:                                                 */
/*  レジスタ初期設定                                            */
/*                                                            */
/**************************************************************/
void func_mset_g_init( void )
{
    func_mset_s_option_reg_setup();     /* オプションレジスタ設定 */
    func_mset_s_oscillator_setup();     /* マイコンクロック設定  */
    func_mset_s_pwr_save_setup();       /* 省電力関連の設定　　　 */
    func_mset_s_int_setup();            /* 割り込み設定         */
    func_mset_s_port_setup();           /* ポート設定           */
    func_mset_s_ioc_setup();            /* IOC機能設定          */
    func_mset_s_pps_setup();            /* ポート割り当て選択設定 */
    func_mset_s_adc_setup();            /* AD変換設定           */
    func_mset_s_timer_setup();          /* タイマ設定           */
}


/**************************************************************/
/*  Function:                                                 */
/*  プログラム開始直前の設定                                    */
/*                                                            */
/**************************************************************/
void func_mset_g_mcu_start_condition( void )
{
    INTCON |= 0xC0U;     /* 全体割り込み(高優先度&低優先度) 許可 */
    ADCON0 |= 0x00U;     /* AD変換器 動作許可 */
}

    /* テンプレ */
    /*========================================================================================*/
                            /*  +-------------------------------------------- 15 :            */
                            /*  | +------------------------------------------ 14 :            */
                            /*  | | +---------------------------------------- 13 : FCMEN      */
                            /*  | | | +-------------------------------------- 12 : TMR0SE     */
                            /*  | | | |                                                       */
                            /*  | | | |     +-------------------------------- 11 : PSA        */
                            /*  | | | |     | +------------------------------ 10 : PS<2>      */
                            /*  | | | |     | | +---------------------------- 9  : PS<1>      */
                            /*  | | | |     | | | + ------------------------- 8  : PS<0>      */
                            /*  | | | |     | | | |     +-------------------- 7  :            */
                            /*  | | | |     | | | |     | +------------------ 6  :            */
                            /*  | | | |     | | | |     | | +---------------- 5  :  FCMEN     */
                            /*  | | | |     | | | |     | | | +-------------- 4  : TMR0SE     */
                            /*  | | | |     | | | |     | | | |                               */
                            /*  | | | |     | | | |     | | | |     +-------- 3  : PSA        */
                            /*  | | | |     | | | |     | | | |     | +------ 2  : PS<2>      */
                            /*  | | | |     | | | |     | | | |     | | +---- 1  : PS<1>      */
                            /*  | | | |     | | | |     | | | |     | | | +-- 0  : PS<0>      */
                            /*  | | | |     | | | |     | | | |     | | | |                   */
                            /*  0 0 0 0  -  0 1 1 0  -  0 0 0 0  -  0 0 0 0                   */
    /*----------------------------------------------------------------------------------------*/
    /* memo                                                                                   */
    /*                                                                                        */
    /*========================================================================================*/
    
    /*=================================================================*/
                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : TUN5    */
                            /*  | | | +------------------- 4 : TUN4    */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : TUN3    */
                            /*  | | | |     | +----------- 2 : TUN2    */
                            /*  | | | |     | | +--------- 1 : TUN1    */
                            /*  | | | |     | | | + ------ 0 : TUN0    */
                            /*  0 0 0 0  -  0 0 1 1                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 特に調整するつもりはないので初期設定                               */
    /*=================================================================*/

/**************************************************************/
/*  Function:                                                 */
/*  オプションレジスタ初期設定                                   */
/*  クロックより先に設定したほうがよさそう                        */
/**************************************************************/
static void func_mset_s_option_reg_setup( void )
{
    ;
}


/**************************************************************/
/*  Function:                                                 */
/*  クロック初期設定                                            */
/*                                                            */
/**************************************************************/
static void func_mset_s_oscillator_setup( void )
{
    /* 新クロック周波数設定 */
    /*=================================================================*/
                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 : NOSC<2> */   /* HFINTOSC */
                            /*  | | +--------------------- 5 : NOSC<1> */ 
                            /*  | | | +------------------- 4 : NOSC<0> */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : NDIV<3> */   /* 分周 1:1 */
                            /*  | | | |     | +----------- 2 : NDIV<2> */
                            /*  | | | |     | | +--------- 1 : NDIV<1> */
                            /*  | | | |     | | | + ------ 0 : NDIV<0> */
    OSCCON1 =  0x60U;       /*  0 1 1 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* 現在のクロック周波数設定 */
    /*=================================================================*/
                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 : COSC<2> */   /* HFINTOSC */
                            /*  | | +--------------------- 5 : COSC<1> */ 
                            /*  | | | +------------------- 4 : COSC<0> */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : CDIV<3> */   /* 分周 1:1 */
                            /*  | | | |     | +----------- 2 : CDIV<2> */
                            /*  | | | |     | | +--------- 1 : CDIV<1> */
                            /*  | | | |     | | | + ------ 0 : CDIV<0> */
    OSCCON2 =  0x60U;       /*  0 1 1 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* 現在のクロック周波数設定 */
    /*=================================================================*/
                            /*  +------------------------- 7 : CSWHOLD */   /* クロック準備整ったら自動切換え */
                            /*  | +----------------------- 6 : SOSCPWR */   /*  */
                            /*  | | +--------------------- 5 :         */ 
                            /*  | | | +------------------- 4 : ORDY    */   /* RO */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : NOSCR   */   /* RO */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    OSCCON3 =  0x00U;       /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /*OSCSTAT = 0x00U;*/    /* RO */

    /* HFINTOSC 周波数設定 */
    /*==================================================================*/
                            /*  +------------------------- 7 :          */
                            /*  | +----------------------- 6 :          */
                            /*  | | +--------------------- 5 :          */ 
                            /*  | | | +------------------- 4 :          */
                            /*  | | | |                                 */
                            /*  | | | |     +------------- 3 : HFFRQ<3> */
                            /*  | | | |     | +----------- 2 : HFFRQ<2> */
                            /*  | | | |     | | +--------- 1 : HFFRQ<1> */
                            /*  | | | |     | | | + ------ 0 : HFFRQ<0> */
    OSCFRQ =  0x08U;       /*  0 0 0 0  -  0 0 0 0                      */
    /*------------------------------------------------------------------*/
    /* memo                                                             */
    /*                                                                  */
    /*==================================================================*/

