aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c
    /* 割り込み許可 */
    /*=================================================================*/
                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : TMR0IE  */   /* タイマ0割り込み 無効 */
                            /*  | | | +------------------- 4 : IOCIE   */   /* IOC割り込み 無効 */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : -       */
                            /*  | | | |     | +----------- 2 : INT2IE  */   /* INT2ピン エッジ割り込み 無効 */
                            /*  | | | |     | | +--------- 1 : INT1IE  */   /* INT1ピン エッジ割り込み 無効 */
                            /*  | | | |     | | | + ------ 0 : INT0IE  */   /* INT0ピン エッジ割り込み 無効 */
    PIE0 = 0x00U;           /*  0 0 0 0  -  0 0 1 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* 割り込み優先度 */
    /*=================================================================*/
                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : TMR0IP  */
                            /*  | | | +------------------- 4 : IOCIP   */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : -       */
                            /*  | | | |     | +----------- 2 : INT2IP  */
                            /*  | | | |     | | +--------- 1 : INT1IP  */
                            /*  | | | |     | | | + ------ 0 : INT0IP  */
    IPR0 = 0x00U;           /*  0 0 0 0  -  0 0 1 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* 割り込みフラグ */
    /*=================================================================*/
                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : TMR0IF  */
                            /*  | | | +------------------- 4 : IOCIF   */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : -       */
                            /*  | | | |     | +----------- 2 : INT2IF  */
                            /*  | | | |     | | +--------- 1 : INT1IF  */
                            /*  | | | |     | | | + ------ 0 : INT0IF  */
    PIR0 = 0x00U;           /*  0 0 0 0  -  0 0 1 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/




    /* 割り込み許可 */
    /*=================================================================*/
                            /*  +------------------------- 7 : OSCFIE  */   /* 発振器以上割り込み　無効 */
                            /*  | +----------------------- 6 : CSWIE   */   /* クロック スイッチ割り込み 無効 */
                            /*  | | +--------------------- 5 : -       */
                            /*  | | | +------------------- 4 : -       */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : -       */
                            /*  | | | |     | +----------- 2 : -       */
                            /*  | | | |     | | +--------- 1 : ADTIE   */   /* AD変換 閾値割り込み　無効 */
                            /*  | | | |     | | | + ------ 0 : ADIE    */   /* AD変換 完了割り込み 有効 */
    PIE1 = 0x01U;           /*  0 0 0 0  -  0 0 0 1                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* 割り込み優先度 */
    /*=================================================================*/
                            /*  +------------------------- 7 : OSCFIP  */
                            /*  | +----------------------- 6 : CSWIP   */
                            /*  | | +--------------------- 5 : -       */
                            /*  | | | +------------------- 4 : -       */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : -       */
                            /*  | | | |     | +----------- 2 : -       */
                            /*  | | | |     | | +--------- 1 : ADTIP   */
                            /*  | | | |     | | | + ------ 0 : ADIP    */
    IPR1 = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* 割り込みフラグ */
    /*=================================================================*/
                            /*  +------------------------- 7 : OSCFIF  */
                            /*  | +----------------------- 6 : CSWIF   */
                            /*  | | +--------------------- 5 : -       */
                            /*  | | | +------------------- 4 : -       */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : -       */
                            /*  | | | |     | +----------- 2 : -       */
                            /*  | | | |     | | +--------- 1 : ADTIF   */
                            /*  | | | |     | | | + ------ 0 : ADIF    */
    PIR1 = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/





