aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c
    /* 割り込み許可 */
    /*=================================================================*/
                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : TMR6IE  */   /* タイマ6 PR6 一致割り込み　無効 */
                            /*  | | | +------------------- 4 : TMR5IE  */   /* タイマ5 オーバーフロー割り込み　無効 */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : TMR4IE  */   /* タイマ4 PR4 一致割り込み　無効 */
                            /*  | | | |     | +----------- 2 : TMR3IE  */   /* タイマ3 オーバーフロー割り込み　無効 */
                            /*  | | | |     | | +--------- 1 : TMR2IE  */   /* タイマ2 一致割り込み　無効 */
                            /*  | | | |     | | | + ------ 0 : TMR1IE  */   /* タイマ1 オーバーフロー割り込み　無効 */
    PIE4 = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* 割り込みフラグ */
    /*=================================================================*/
                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : TMR6IP  */
                            /*  | | | +------------------- 4 : TMR5IP  */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : TMR4IP  */
                            /*  | | | |     | +----------- 2 : TMR3IP  */
                            /*  | | | |     | | +--------- 1 : TMR2IP  */
                            /*  | | | |     | | | + ------ 0 : TMR1IP  */
    IPR4 = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* 割り込みフラグ */
    /*=================================================================*/
                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : TMR6IF  */
                            /*  | | | +------------------- 4 : TMR5IF  */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : TMR4IF  */
                            /*  | | | |     | +----------- 2 : TMR3IF  */
                            /*  | | | |     | | +--------- 1 : TMR2IF  */
                            /*  | | | |     | | | + ------ 0 : TMR1IF  */
    PIR4 = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/




    /* 割り込み許可 */
    /*=================================================================*/
                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : -       */
                            /*  | | | +------------------- 4 : -       */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : -       */
                            /*  | | | |     | +----------- 2 : TMR5GIE */   /* タイマ5 ゲート割り込み　無効 */
                            /*  | | | |     | | +--------- 1 : TMR3GIE */   /* タイマ3 ゲート割り込み　無効 */
                            /*  | | | |     | | | + ------ 0 : TMR1GIE */   /* タイマ1 ゲート割り込み　無効 */
    PIE5 = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* 割り込み優先度 */
    /*=================================================================*/
                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : -       */
                            /*  | | | +------------------- 4 : -       */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : -       */
                            /*  | | | |     | +----------- 2 : TMR5GIP */
                            /*  | | | |     | | +--------- 1 : TMR3GIP */
                            /*  | | | |     | | | + ------ 0 : TMR1GIP */
    IPR5 = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* 割り込みフラグ */
    /*=================================================================*/
                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : -       */
                            /*  | | | +------------------- 4 : -       */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : -       */
                            /*  | | | |     | +----------- 2 : TMR5GIF */
                            /*  | | | |     | | +--------- 1 : TMR3GIF */
                            /*  | | | |     | | | + ------ 0 : TMR1GIF */
    PIR5 = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/




