aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c
    /* オープンドレイン制御 レジスタ */
    /*=================================================================*/
                            /*  +------------------------- 7 : ODCB7   */
                            /*  | +----------------------- 6 : ODCB6   */
                            /*  | | +--------------------- 5 : ODCB5   */
                            /*  | | | +------------------- 4 : ODCB4   */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : ODCB3   */
                            /*  | | | |     | +----------- 2 : ODCB2   */
                            /*  | | | |     | | +--------- 1 : ODCB1   */
                            /*  | | | |     | | | + ------ 0 : ODCB0   */
    ODCONB = 0x00U;         /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 0：プッシュプル　シンク/ソース両方向                               */
    /* 1：オープンドレイン有効　シンク方向のみ                             */
    /*=================================================================*/

    /* ポートスルーレート制御 レジスタ */
    /*=================================================================*/
                            /*  +------------------------- 7 : SLRB7   */
                            /*  | +----------------------- 6 : SLRB6   */
                            /*  | | +--------------------- 5 : SLRB5   */
                            /*  | | | +------------------- 4 : SLRB4   */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : SLRB3   */
                            /*  | | | |     | +----------- 2 : SLRB2   */
                            /*  | | | |     | | +--------- 1 : SLRB1   */
                            /*  | | | |     | | | + ------ 0 : SLRB0   */
    SLRCONB = 0x00U;        /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 0：スルーレート 最大　　                                          */
    /* 1：スルーレート 制限付き                                          */
    /*=================================================================*/

    
    /* ポート入力バッファの種類 選択レジスタ */
    /*=================================================================*/
                            /*  +------------------------- 7 : SLRA7   */
                            /*  | +----------------------- 6 : SLRA6   */
                            /*  | | +--------------------- 5 : SLRA5   */
                            /*  | | | +------------------- 4 : SLRA4   */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : SLRA3   */
                            /*  | | | |     | +----------- 2 : SLRA2   */
                            /*  | | | |     | | +--------- 1 : SLRA1   */
                            /*  | | | |     | | | + ------ 0 : SLRA0   */
    INLVLB = 0xFFU;         /*  1 1 1 1  -  1 1 1 1                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 0：入力読み取りは TTL バッファを使う                               */
    /* 1：入力読み取りは  ST バッファを使う                               */    /* こっちのほうがL->H遷移の閾値高いので安定 */
    /*=================================================================*/


    /*==========================================================================================================================================================================*/


    /* ポート入出力方向設定 */
    /*=================================================================*/
                            /*  +------------------------- 7 : TRISC7  */   /* OUT：インバータPWM　ゲート1A */
                            /*  | +----------------------- 6 : TRISC6  */   /* OUT：インバータPWM　ゲート1B */
                            /*  | | +--------------------- 5 : TRISC5  */   /* OUT：インバータPWM　ゲート1C */
                            /*  | | | +------------------- 4 : TRISC4  */   /* OUT：インバータPWM　ゲート1D */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : TRISC3  */   /* OUT：クラッチサーボ　PWM */
                            /*  | | | |     | +----------- 2 : TRISC2  */   /* IN：バッテリ低電圧検出 */
                            /*  | | | |     | | +--------- 1 : TRISC1  */   /* IN：負荷軸側　回転数キャプチャ */
                            /*  | | | |     | | | + ------ 0 : TRISC0  */   /* IN：モータ側　回転数キャプチャ */
    TRISC = 0x07U;          /*  0 0 0 0  -  0 1 1 1                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 0:出力、1:入力                                                   */
    /* RA4は入力専用ポートなので注意                                     */
    /*=================================================================*/

    /* ポート読み取り　レジスタ */
    /*=================================================================*/
                            /*  +------------------------- 7 : RC7     */
                            /*  | +----------------------- 6 : RC6     */
                            /*  | | +--------------------- 5 : RC5     */
                            /*  | | | +------------------- 4 : RC4     */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : RC3     */
                            /*  | | | |     | +----------- 2 : RC2     */
                            /*  | | | |     | | +--------- 1 : RC1     */
                            /*  | | | |     | | | + ------ 0 : RC0     */
    PORTC = 0x00U;          /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* ポート書き込み レジスタ */
    /*=================================================================*/
                            /*  +------------------------- 7 : LATC7   */
                            /*  | +----------------------- 6 : LATC6   */
                            /*  | | +--------------------- 5 : LATC5   */
                            /*  | | | +------------------- 4 : LATC4   */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : LATC3   */
                            /*  | | | |     | +----------- 2 : LATC2   */
                            /*  | | | |     | | +--------- 1 : LATC1   */
                            /*  | | | |     | | | + ------ 0 : LATC0   */
    LATC = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

