aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c
    /* ピン変化割り込み L->H遷移許可 */
    /*==================================================================*/
                            /*  +------------------------- 7 : IOCAN7   */
                            /*  | +----------------------- 6 : IOCAN6   */
                            /*  | | +--------------------- 5 : IOCAN5   */
                            /*  | | | +------------------- 4 : IOCAN4   */
                            /*  | | | |                                 */
                            /*  | | | |     +------------- 3 : IOCAN3   */
                            /*  | | | |     | +----------- 2 : IOCAN2   */
                            /*  | | | |     | | +--------- 1 : IOCAN1   */
                            /*  | | | |     | | | + ------ 0 : IOCAN0   */  /* 前進/後退 加速量 */
    IOCAP = 0x01U;          /*  0 0 0 0  -  0 0 0 1                     */
    /*------------------------------------------------------------------*/
    /* memo                                                             */  /* ラジコンのパルスは同一時間から開始するので、1chのみ開始タイミングを知ることができれば十分 */
    /* 0：L->H遷移で割り込み発生させない                                  */
    /* 1：L->H遷移で割り込み発生させる                                    */
    /*==================================================================*/

    /*========================================================================================================================================*/

    /* ピン変化割り込みフラグ */
    /*==================================================================*/
                            /*  +------------------------- 7 : IOCBF7   */
                            /*  | +----------------------- 6 : IOCBF6   */
                            /*  | | +--------------------- 5 : IOCBF5   */
                            /*  | | | +------------------- 4 : IOCBF4   */
                            /*  | | | |                                 */
                            /*  | | | |     +------------- 3 : IOCBF3   */
                            /*  | | | |     | +----------- 2 : IOCBF2   */
                            /*  | | | |     | | +--------- 1 : IOCBF1   */
                            /*  | | | |     | | | + ------ 0 : IOCBF0   */
    IOCBF = 0x00U;          /*  0 0 0 0  -  0 0 0 0                     */
    /*------------------------------------------------------------------*/
    /* memo                                                             */
    /* H->L遷移、またはL->H遷移でフラグが立つ。IOCxPとIOCxNの設定に依存。    */
    /*==================================================================*/

    /* ピン変化割り込み H->L遷移許可 */
    /*==================================================================*/
                            /*  +------------------------- 7 : IOCBN7   */
                            /*  | +----------------------- 6 : IOCBN6   */
                            /*  | | +--------------------- 5 : IOCBN5   */
                            /*  | | | +------------------- 4 : IOCBN4   */
                            /*  | | | |                                 */
                            /*  | | | |     +------------- 3 : IOCBN3   */
                            /*  | | | |     | +----------- 2 : IOCBN2   */
                            /*  | | | |     | | +--------- 1 : IOCBN1   */
                            /*  | | | |     | | | + ------ 0 : IOCBN0   */
    IOCBN = 0x00U;          /*  0 0 0 0  -  0 0 0 0                     */
    /*------------------------------------------------------------------*/
    /* memo                                                             */
    /* 0：H->L遷移で割り込み発生させない                                  */
    /* 1：H->L遷移で割り込み発生させる                                    */
    /*==================================================================*/

    /* ピン変化割り込み L->H遷移許可 */
    /*==================================================================*/
                            /*  +------------------------- 7 : IOCBN7   */
                            /*  | +----------------------- 6 : IOCBN6   */
                            /*  | | +--------------------- 5 : IOCBN5   */
                            /*  | | | +------------------- 4 : IOCBN4   */
                            /*  | | | |                                 */
                            /*  | | | |     +------------- 3 : IOCBN3   */
                            /*  | | | |     | +----------- 2 : IOCBN2   */
                            /*  | | | |     | | +--------- 1 : IOCBN1   */
                            /*  | | | |     | | | + ------ 0 : IOCBN0   */
    IOCBP = 0x00U;          /*  0 0 0 0  -  0 0 0 0                     */
    /*------------------------------------------------------------------*/
    /* memo                                                             */
    /* 0：L->H遷移で割り込み発生させない                                  */
    /* 1：L->H遷移で割り込み発生させる                                    */
    /*==================================================================*/
    
    /*========================================================================================================================================*/

    /* ピン変化割り込みフラグ */
    /*==================================================================*/
                            /*  +------------------------- 7 : IOCCF7   */
                            /*  | +----------------------- 6 : IOCCF6   */
                            /*  | | +--------------------- 5 : IOCCF5   */
                            /*  | | | +------------------- 4 : IOCCF4   */
                            /*  | | | |                                 */
                            /*  | | | |     +------------- 3 : IOCCF3   */
                            /*  | | | |     | +----------- 2 : IOCCF2   */
                            /*  | | | |     | | +--------- 1 : IOCCF1   */
                            /*  | | | |     | | | + ------ 0 : IOCCF0   */
    IOCCF = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*------------------------------------------------------------------*/
    /* memo                                                             */
    /* H->L遷移、またはL->H遷移でフラグが立つ。IOCxPとIOCxNの設定に依存。    */
    /*==================================================================*/

    /* ピン変化割り込み H->L遷移許可 */
    /*==================================================================*/
                            /*  +------------------------- 7 : IOCCN7   */
                            /*  | +----------------------- 6 : IOCCN6   */
                            /*  | | +--------------------- 5 : IOCCN5   */
                            /*  | | | +------------------- 4 : IOCCN4   */
                            /*  | | | |                                 */
                            /*  | | | |     +------------- 3 : IOCCN3   */
                            /*  | | | |     | +----------- 2 : IOCCN2   */
                            /*  | | | |     | | +--------- 1 : IOCCN1   */
                            /*  | | | |     | | | + ------ 0 : IOCCN0   */
    IOCCN = 0x00U;          /*  0 0 0 0  -  0 0 0 0                     */
    /*------------------------------------------------------------------*/
    /* memo                                                             */
    /* 0：H->L遷移で割り込み発生させない                                  */
    /* 1：H->L遷移で割り込み発生させる                                    */
    /*==================================================================*/

