aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c
    /* ピン変化割り込み L->H遷移許可 */
    /*==================================================================*/
                            /*  +------------------------- 7 : IOCCN7   */
                            /*  | +----------------------- 6 : IOCCN6   */
                            /*  | | +--------------------- 5 : IOCCN5   */
                            /*  | | | +------------------- 4 : IOCCN4   */
                            /*  | | | |                                 */
                            /*  | | | |     +------------- 3 : IOCCN3   */
                            /*  | | | |     | +----------- 2 : IOCCN2   */
                            /*  | | | |     | | +--------- 1 : IOCCN1   */
                            /*  | | | |     | | | + ------ 0 : IOCCN0   */
    IOCCP = 0x00U;          /*  0 0 0 0  -  0 0 0 0                     */
    /*------------------------------------------------------------------*/
    /* memo                                                             */
    /* 0：L->H遷移で割り込み発生させない                                  */
    /* 1：L->H遷移で割り込み発生させる                                    */
    /*==================================================================*/

    /*========================================================================================================================================*/

    /* ピン変化割り込みフラグ */
    /*==================================================================*/
                            /*  +------------------------- 7 : -        */
                            /*  | +----------------------- 6 : -        */
                            /*  | | +--------------------- 5 : -        */
                            /*  | | | +------------------- 4 : -        */
                            /*  | | | |                                 */
                            /*  | | | |     +------------- 3 : IOCEF3   */
                            /*  | | | |     | +----------- 2 : -        */
                            /*  | | | |     | | +--------- 1 : -        */
                            /*  | | | |     | | | + ------ 0 : -        */
    IOCEF = 0x00U;          /*  0 0 0 0  -  0 0 0 0                    */
    /*------------------------------------------------------------------*/
    /* memo                                                             */
    /* H->L遷移、またはL->H遷移でフラグが立つ。IOCxPとIOCxNの設定に依存。    */
    /*==================================================================*/

    /* ピン変化割り込み H->L遷移許可 */
    /*==================================================================*/
                            /*  +------------------------- 7 : -        */
                            /*  | +----------------------- 6 : -        */
                            /*  | | +--------------------- 5 : -        */
                            /*  | | | +------------------- 4 : -        */
                            /*  | | | |                                 */
                            /*  | | | |     +------------- 3 : IOCEN3   */
                            /*  | | | |     | +----------- 2 : -        */
                            /*  | | | |     | | +--------- 1 : -        */
                            /*  | | | |     | | | + ------ 0 : -        */
    IOCEN = 0x00U;          /*  0 0 0 0  -  0 0 0 0                     */
    /*------------------------------------------------------------------*/
    /* memo                                                             */
    /* 0：H->L遷移で割り込み発生させない                                  */
    /* 1：H->L遷移で割り込み発生させる                                    */
    /*==================================================================*/

    /* ピン変化割り込み L->H遷移許可 */
    /*==================================================================*/
                            /*  +------------------------- 7 : -        */
                            /*  | +----------------------- 6 : -        */
                            /*  | | +--------------------- 5 : -        */
                            /*  | | | +------------------- 4 : -        */
                            /*  | | | |                                 */
                            /*  | | | |     +------------- 3 : IOCEP3   */
                            /*  | | | |     | +----------- 2 : -        */
                            /*  | | | |     | | +--------- 1 : -        */
                            /*  | | | |     | | | + ------ 0 : -        */
    IOCEP = 0x00U;          /*  0 0 0 0  -  0 0 0 0                     */
    /*------------------------------------------------------------------*/
    /* memo                                                             */
    /* 0：L->H遷移で割り込み発生させない                                  */
    /* 1：L->H遷移で割り込み発生させる                                    */
    /*==================================================================*/
}

/**************************************************************/
/*  Function:                                                 */
/*  AD変換初期設定                                            */
/*                                                            */
/**************************************************************/
static void func_mset_s_adc_setup( void )
{
    /* AD変換設定1 */
    /*==================================================================*/
                            /*  +------------------------- 7 : -        */
                            /*  | +----------------------- 6 : CHS4     */
                            /*  | | +--------------------- 5 : CHS3     */
                            /*  | | | +------------------- 4 : CHS2     */
                            /*  | | | |                                 */
                            /*  | | | |     +------------- 3 : CHS1     */
                            /*  | | | |     | +----------- 2 : CHS0     */  /* 初期化時はいったん AN0指定 */
                            /*  | | | |     | | +--------- 1 : GO/nDONE */  /* 初期化時は実行しない */
                            /*  | | | |     | | | + ------ 0 : ADON     */  /* 初期化時にAD変換ユニット 無効化 -> プログラム開始時にONする */
    ADCON0 = 0x00U;         /*  0 0 0 0  -  0 0 0 1                     */
    /*------------------------------------------------------------------*/
    /* memo                                                             */
    /*                                                                  */
    /*==================================================================*/

    /* AD変換設定2 */
    /*==================================================================*/
                            /*  +------------------------- 7 : ADFM     */  /* 右詰め LSBから埋めてく */
                            /*  | +----------------------- 6 : ADCS2    */
                            /*  | | +--------------------- 5 : ADCS1    */
                            /*  | | | +------------------- 4 : ADCS0    */  /* 110:クロック32MHzのため、Fosc/64に設定 */
                            /*  | | | |                                 */
                            /*  | | | |     +------------- 3 : -        */
                            /*  | | | |     | +----------- 2 : ADNREF   */  /* 負側の電位基準：VSS(GND) */
                            /*  | | | |     | | +--------- 1 : ADPREF1  */
                            /*  | | | |     | | | + ------ 0 : ADPREF0  */  /* 正側の電位基準：AVDD */
    ADCON1 = 0xA0U;         /*  1 0 1 0  -  0 0 0 0                     */
    /*------------------------------------------------------------------*/
    /* memo                                                             */
    /*                                                                  */
    /*==================================================================*/

    /* AD変換設定3 */
    /*==================================================================*/
                            /*  +------------------------- 7 : -        */
                            /*  | +----------------------- 6 : -        */
                            /*  | | +--------------------- 5 : -        */
                            /*  | | | +------------------- 4 : -        */
                            /*  | | | |                                 */
                            /*  | | | |     +------------- 3 : -        */
                            /*  | | | |     | +----------- 2 : -        */
                            /*  | | | |     | | +--------- 1 : ADRES9   */
                            /*  | | | |     | | | + ------ 0 : ADRES8   */
    ADRESH = 0x00U;         /*  0 0 0 0  -  0 0 0 0                     */
    /*------------------------------------------------------------------*/
    /* memo                                                             */
    /* ADFMの設定内容によって右詰め、左詰め変わるので注意                   */
    /*==================================================================*/

    /* AD変換設定3 */
    /*==================================================================*/
                            /*  +------------------------- 7 : ADRES7   */
                            /*  | +----------------------- 6 : ADRES6   */
                            /*  | | +--------------------- 5 : ADRES5   */
                            /*  | | | +------------------- 4 : ADRES4   */
                            /*  | | | |                                 */
                            /*  | | | |     +------------- 3 : ADRES3   */
                            /*  | | | |     | +----------- 2 : ADRES2   */
                            /*  | | | |     | | +--------- 1 : ADRES1   */
                            /*  | | | |     | | | + ------ 0 : ADRES0   */
    ADRESL = 0x00U;         /*  0 0 0 0  -  0 0 0 0                     */
    /*------------------------------------------------------------------*/
    /* memo                                                             */
    /* ADFMの設定内容によって右詰め、左詰め変わるので注意                   */
    /*==================================================================*/
}


/**************************************************************/
/*  Function:                                                 */
/*  タイマ初期設定                                            */
/*                                                            */
/**************************************************************/
static void func_mset_s_pps_setup( void )
{ /* 改めてクソ高級マイコンだなと思う 全部のポートで割り当て変更可能・・・ */
    /* データシート補足 */
    /* xxxPPS：これは特定のレジスタを挿すわけではない */
    /* []PPSにおいて、ポート入力を選ぶ場合に、PORTA/B/Cのx番を登録したい際、どのように設定すればよいか、その設定例を示したもの。 */
    /* xxxPPSという１つのレジスタがあるわけではなく、以降の設定について説明しているだけ。 */

    /* PORT<1:0> ---- 00：PORTA / 01：PORTB / 10：PORTC */
    /* PIN<2:0>  ---- 2進数で0～7を指定する */

    /* ピン機能選択 有効/無効 切り替えレジスタ */
    PPSLOCK = 0x00;             /* ロック解除：PPS機能選択を許可 */


    /* @@基本初期値 必要に応じて設定 */

