aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c
    /* 出力割り当て設定 */
    /* PORTAの出力バッファの選択 */
    RA0PPS = 0x00U;             /* LATA0 を割り当て */
    RA1PPS = 0x00U;             /* LATA1 を割り当て */
    RA2PPS = 0x00U;             /* LATA2 を割り当て */
    RA3PPS = 0x00U;             /* LATA3 を割り当て */
    RA4PPS = 0x00U;             /* LATA4 を割り当て */
    RA5PPS = 0x00U;             /* LATA5 を割り当て */
    RA6PPS = 0x00U;             /* LATA6 を割り当て */
    RA7PPS = 0x00U;             /* LATA7 を割り当て */

    /* PORTBの出力バッファの選択 */
    RB0PPS = 0x00U;             /* LATB0 を割り当て */
    RB1PPS = 0x00U;             /* LATB1 を割り当て */
    RB2PPS = 0x00U;             /* LATB2 を割り当て */
    RB3PPS = 0x00U;             /* LATB3 を割り当て */
    RB4PPS = 0x00U;             /* LATB4 を割り当て */
    RB5PPS = 0x00U;             /* LATB5 を割り当て */
    RB6PPS = 0x00U;             /* LATB6 を割り当て */
    RB7PPS = 0x00U;             /* LATB7 を割り当て */

    /* PORTCの出力バッファの選択 */
    RC0PPS = 0x00U;             /* LATC0 を割り当て */
    RC1PPS = 0x00U;             /* LATC1 を割り当て */
    RC2PPS = 0x00U;             /* LATC2 を割り当て */
    RC3PPS = 0x00U;             /* LATC3 を割り当て */
    RC4PPS = 0x00U;             /* LATC4 を割り当て */
    RC5PPS = 0x00U;             /* LATC5 を割り当て */
    RC6PPS = 0x00U;             /* LATC6 を割り当て */
    RC7PPS = 0x00U;             /* LATC7 を割り当て */




    /* 一応設定終わったらロックしとく */
    /* ピン機能選択 有効/無効 切り替えレジスタ */
    PPSLOCK = 0x01;             /* ロック設定：PPS機能選択を禁止 */
}





/**************************************************************/
/*  Function:                                                 */
/*  タイマ初期設定                                            */
/*                                                            */
/**************************************************************/
static void func_mset_s_timer_setup( void )
{
    func_mset_s_timer0_setup();     /* メインタスク用 タイマ0 */

    func_mset_s_ccp_setup();        /* CCP機能設定 */
    func_mset_s_timer2_setup();     /* シフト用サーボ 00 ※CCP機能へ割り当て中 */
    func_mset_s_timer4_setup();     /* シフト用サーボ 01 ※CCP機能へ割り当て中 */
    func_mset_s_timer6_setup();     /* シフト用サーボ 02 ※CCP機能へ割り当て中 */
}




/**************************************************************/
/*  Function:                                                 */
/*  タイマ0初期設定                                            */
/*  メインタスクの時間管理用につかう                             */
/**************************************************************/
static void func_mset_s_timer0_setup( void )
{
    /* タイマ0のクロックソースはPPS設定内で処理 */
    /* Fosc/4 で内部クロック選択した時点で、PPSは影響なし */

    /* タイマ初期設定 */
    /*====================================================================*/
                            /*  +------------------------- 7 : T0EN       */    /* タイマ0 動作許可 */ 
                            /*  | +----------------------- 6 : -          */
                            /*  | | +--------------------- 5 : T0OUT      */    /* RO */
                            /*  | | | +------------------- 4 : T016BIT    */    /* 8bit タイマモード */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : T0OUTPS<3> */    /* 割り込みポストスケーラ：1:1 */
                            /*  | | | |     | +----------- 2 : T0OUTPS<2> */
                            /*  | | | |     | | +--------- 1 : T0OUTPS<1> */
                            /*  | | | |     | | | + ------ 0 : T0OUTPS<0> */
    T0CON0 = 0x80U;         /*  1 0 0 0  -  0 0 0 0                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /*                                                                    */
    /*====================================================================*/

    /*====================================================================*/
                            /*  +------------------------- 7 : T0CS<2>    */    /* 010：Fosc/4 を選択 -> 64/4=16MHz */
                            /*  | +----------------------- 6 : T0CS<1>    */
                            /*  | | +--------------------- 5 : T0CS<0>    */
                            /*  | | | +------------------- 4 : T0ASYNC    */    /* 0:同期を選択 */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : T0CKPS<3>  */    /* 0110:プリスケーラ：1:64 */
                            /*  | | | |     | +----------- 2 : T0CKPS<2>  */
                            /*  | | | |     | | +--------- 1 : T0CKPS<1>  */
                            /*  | | | |     | | | + ------ 0 : T0CKPS<0>  */
    T0CON1 = 0x46U;         /*  0 1 0 0  -  0 1 1 0                        */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /*                                                                    */
    /*====================================================================*/

    /* タイマ0 周期設定 ※8bitタイマモード */
    /*===================================================================*/
                            /*  +------------------------- 7 : TMR0H<7>  */
                            /*  | +----------------------- 6 : TMR0H<6>  */
                            /*  | | +--------------------- 5 : TMR0H<5>  */
                            /*  | | | +------------------- 4 : TMR0H<4>  */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : TMR0H<3>  */
                            /*  | | | |     | +----------- 2 : TMR0H<2>  */
                            /*  | | | |     | | +--------- 1 : TMR0H<1>  */
                            /*  | | | |     | | | + ------ 0 : TMR0H<0>  */
    TMR0H = 0x19U;          /*  0 0 0 1  -  1 0 0 1                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /*                                                                   */
    /*===================================================================*/

    /* タイマ0 カウンタレジスタ ※8bitタイマモード */
    /*===================================================================*/
                            /*  +------------------------- 7 : TMR0L<7>  */
                            /*  | +----------------------- 6 : TMR0L<6>  */
                            /*  | | +--------------------- 5 : TMR0L<5>  */
                            /*  | | | +------------------- 4 : TMR0L<4>  */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : TMR0L<3>  */
                            /*  | | | |     | +----------- 2 : TMR0L<2>  */
                            /*  | | | |     | | +--------- 1 : TMR0L<1>  */
                            /*  | | | |     | | | + ------ 0 : TMR0L<0>  */
    TMR0L = 0x00U;          /*  0 0 0 0  -  0 0 0 0                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /*                                                                   */
    /*===================================================================*/
}


/**************************************************************/
/*  Function:                                                 */
/*  CCPモジュール設定                                           */
/*  Capture/Compare/PWM 機能設定につかう                        */
/**************************************************************/
static void func_mset_s_ccp_setup( void )
{
    /* CCPモジュール 動作モード選択 */
    /* タイマの附番と連動してないので、確認しずらい・・・ */
    /*===================================================================*/
                            /*  +------------------------- 7 : PxM<1>    */  /* 00:PWMシングル出力 ※CCP4,CCP3はECCP機能ないので、割り当てたとしてもPWM複数制御は実施不可 */
                            /*  | +----------------------- 6 : PxM<0>    */
                            /*  | | +--------------------- 5 : DCxB<1>   */  /* PWMのdutyサイクルの下2bit とりあえず初期化時は0 */
                            /*  | | | +------------------- 4 : DCxB<0>   */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : CCPxM<3>  */  /* 1100:PWMシングルにしてるので、PxAポートのみPWM出力 */
                            /*  | | | |     | +----------- 2 : CCPxM<2>  */  /* ※CCP4,CCP3はECCP機能ないので、割り当てたとしてもPWM複数制御は実施不可 */
                            /*  | | | |     | | +--------- 1 : CCPxM<1>  */
                            /*  | | | |     | | | + ------ 0 : CCPxM<0>  */
    //CCP4CON = 0x0CU;        /*  0 0 0 0  -  1 1 0 0                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /*                                                                   */
    /*===================================================================*/

    /*===================================================================*/
                            /*  +------------------------- 7 : PxM<1>    */  /* 00:PWMシングル出力 ※CCP4,CCP3はECCP機能ないので、割り当てたとしてもPWM複数制御は実施不可 */
                            /*  | +----------------------- 6 : PxM<0>    */
                            /*  | | +--------------------- 5 : DCxB<1>   */  /* PWMのdutyサイクルの下2bit とりあえず初期化時は0 */
                            /*  | | | +------------------- 4 : DCxB<0>   */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : CCPxM<3>  */  /* 1100:PWMシングルにしてるので、PxAポートのみPWM出力 */
                            /*  | | | |     | +----------- 2 : CCPxM<2>  */  /* ※CCP4,CCP3はECCP機能ないので、割り当てたとしてもPWM複数制御は実施不可 */
                            /*  | | | |     | | +--------- 1 : CCPxM<1>  */
                            /*  | | | |     | | | + ------ 0 : CCPxM<0>  */
    //CCP3CON = 0x0CU;        /*  0 0 0 0  -  1 1 0 0                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /*                                                                   */
    /*===================================================================*/

    /*===================================================================*/
                            /*  +------------------------- 7 : PxM<1>    */  /* 00:PWMシングル出力 ※CCP4,CCP3はECCP機能ないので、割り当てたとしてもPWM複数制御は実施不可 */
                            /*  | +----------------------- 6 : PxM<0>    */
                            /*  | | +--------------------- 5 : DCxB<1>   */  /* PWMのdutyサイクルの下2bit とりあえず初期化時は0 */
                            /*  | | | +------------------- 4 : DCxB<0>   */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : CCPxM<3>  */  /* 1100:PWMシングルにしてるので、PxAポートのみPWM出力 */
                            /*  | | | |     | +----------- 2 : CCPxM<2>  */  /* ※CCP4,CCP3はECCP機能ないので、割り当てたとしてもPWM複数制御は実施不可 */
                            /*  | | | |     | | +--------- 1 : CCPxM<1>  */
                            /*  | | | |     | | | + ------ 0 : CCPxM<0>  */
    //CCP2CON = 0x0CU;        /*  0 0 0 0  -  1 1 0 0                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /*                                                                   */
    /*===================================================================*/

    /*===================================================================*/
                            /*  +------------------------- 7 : PxM<1>    */  /* 00:PWMシングル出力 ※CCP4,CCP3はECCP機能ないので、割り当てたとしてもPWM複数制御は実施不可 */
                            /*  | +----------------------- 6 : PxM<0>    */
                            /*  | | +--------------------- 5 : DCxB<1>   */  /* PWMのdutyサイクルの下2bit とりあえず初期化時は0 */
                            /*  | | | +------------------- 4 : DCxB<0>   */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : CCPxM<3>  */  /* 1100:PWMシングルにしてるので、PxAポートのみPWM出力 */
                            /*  | | | |     | +----------- 2 : CCPxM<2>  */  /* ※CCP4,CCP3はECCP機能ないので、割り当てたとしてもPWM複数制御は実施不可 */
                            /*  | | | |     | | +--------- 1 : CCPxM<1>  */
                            /*  | | | |     | | | + ------ 0 : CCPxM<0>  */
    CCP1CON = 0x0CU;        /*  0 0 0 0  -  1 1 0 0                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /*                                                                   */
    /*===================================================================*/

    /* CCPモジュールへのタイマ割り当て設定 */
    /*===================================================================*/
                            /*  +------------------------- 7 : C4TSEL<1> */  /* CCP4:未割当て */
                            /*  | +----------------------- 6 : C4TSEL<0> */
                            /*  | | +--------------------- 5 : C3TSEL<1> */  /* CCP3:Timer6 */
                            /*  | | | +------------------- 4 : C3TSEL<0> */
                            /*  | | | |                                  */
                            /*  | | | |     +------------- 3 : C2TSEL<1> */  /* CCP2:Timer4 */
                            /*  | | | |     | +----------- 2 : C2TSEL<0> */
                            /*  | | | |     | | +--------- 1 : C1TSEL<1> */  /* CCP1:Timer2 */
                            /*  | | | |     | | | + ------ 0 : C1TSEL<0> */
    CCPTMRS = 0xE4U;        /*  1 1 1 0  -  0 1 0 0                      */
    /*-------------------------------------------------------------------*/
    /* memo                                                              */
    /* 00:Timer2                                                         */
    /* 01:Timer4                                                         */
    /* 10:Timer6                                                         */
    /* 11:未割当                                                          */
    /*===================================================================*/


    /* PWM キャリア周期設定 */
    /* !!!!この項目はタイマ初期化関数で設定する!!!! */
    /*=================================================================*/

                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    /*PRx = 0xFFU;*/        /*  0 0 0 0  -  0 0 0 0                   */   /* CCPではなくタイマ側で設定している */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* !!!!この項目はタイマ初期化関数で設定する!!!! */
    /*=================================================================*/

                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    /*PRx = 0xFFU;*/        /*  0 0 0 0  -  0 0 0 0                   */   /* CCPではなくタイマ側で設定している */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* !!!!この項目はタイマ初期化関数で設定する!!!! */
    /*=================================================================*/

                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    /*PRx = 0xFFU;*/        /*  0 0 0 0  -  0 0 0 0                   */   /* CCPではなくタイマ側で設定している */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/


    /* PWM duty比 設定 */
    /*=================================================================*/
                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    //CCPR3L = 0x00;          /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* dutyは全部で10bit指定。                                          */
    /* 下位2bitはCCPxCONのDCxBビットに隠れてるので注意                    */
    /*=================================================================*/
    
