aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c
    /*=================================================================*/
                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    CCPR2L = 0x00;          /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* dutyは全部で10bit指定。                                          */
    /* 下位2bitはCCPxCONのDCxBビットに隠れてるので注意                    */
    /*=================================================================*/

    /*=================================================================*/
                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    CCPR1L = 0x00;          /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* dutyは全部で10bit指定。                                          */
    /* 下位2bitはCCPxCONのDCxBビットに隠れてるので注意                    */
    /*=================================================================*/
}


/**************************************************************/
/*  Function:                                                 */
/*  タイマ0初期設定                                            */
/*  メインタスクの時間管理用につかう                             */
/**************************************************************/
static void func_mset_s_timer2_setup( void )
{
    /* 対応するCCPモジュール:CCP1 */
    /* タイマ2の設定 */
    /* ※一致割り込みを使用するだけなら、CCPの設定はいらない */
    /* タイマレジスタ初期化 */
    /*=================================================================*/
                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    TMR2 = 0xFFU;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/
    

    /* タイマ4初期設定 */
    /*====================================================================*/
                            /*  +------------------------- 7 : -          */
                            /*  | +----------------------- 6 : TxOUTPS<3> */
                            /*  | | +--------------------- 5 : TxOUTPS<2> */
                            /*  | | | +------------------- 4 : TxOUTPS<1> */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : TxOUTPS<0> */
                            /*  | | | |     | +----------- 2 : TMRxON     */    /* タイマ2動作 許可 */
                            /*  | | | |     | | +--------- 1 : TxCKPS<1>  */    /* タイマ2 プリスケーラ：11 -> 1/64 */
                            /*  | | | |     | | | + ------ 0 : TxCKPS<0>  */
    T2CON = 0x07U;          /*  0 0 0 0  -  0 1 1 1                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /* クロック:16MHz                                                      */
    /* ペリフェラルクロック：Fosc/4 = 4MHz                                  */
    /* プリスケーラ：1/64 -> 62,500Hz                                      */
    /* 一致カウント数(キャリア周期カウントPRx)設定：255 -> 12,500/(255+1) = 244.14...Hz -> 4.096...ms */
    /*====================================================================*/


    /* タイマ4 一致割り込み発生数値 */
    /* PWMのキャリア周期になる */
    /*=================================================================*/
                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    PR2 = 0xFFU;            /*  1 1 1 1  -  1 1 1 1                    */   /* 最大カウントで一致割り込み発生させる */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*=================================================================*/
}


/**************************************************************/
/*  Function:                                                 */
/*  タイマ0初期設定                                            */
/*  メインタスクの時間管理用につかう                             */
/**************************************************************/
static void func_mset_s_timer4_setup( void )
{
    /* 対応するCCPモジュール:CCP2 */
    /* タイマ4の設定 */
    /* ※一致割り込みを使用するだけなら、CCPの設定はいらない */
    /* タイマレジスタ初期化 */
    /*=================================================================*/
                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    TMR4 = 0xFFU;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/
    

    /* タイマ4初期設定 */
    /*====================================================================*/
                            /*  +------------------------- 7 : -          */
                            /*  | +----------------------- 6 : TxOUTPS<3> */
                            /*  | | +--------------------- 5 : TxOUTPS<2> */
                            /*  | | | +------------------- 4 : TxOUTPS<1> */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : TxOUTPS<0> */
                            /*  | | | |     | +----------- 2 : TMRxON     */    /* タイマ4動作 許可 */
                            /*  | | | |     | | +--------- 1 : TxCKPS<1>  */    /* タイマ4 プリスケーラ：11 -> 1/64 */
                            /*  | | | |     | | | + ------ 0 : TxCKPS<0>  */
    T4CON = 0x07U;          /*  0 0 0 0  -  0 1 1 1                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /* クロック:16MHz                                                      */
    /* ペリフェラルクロック：Fosc/4 = 4MHz                                  */
    /* プリスケーラ：1/64 -> 62,500Hz                                      */
    /* 一致カウント数(キャリア周期カウントPRx)設定：255 -> 12,500/(255+1) = 244.14...Hz -> 4.096...ms */
    /*====================================================================*/


    /* タイマ4 一致割り込み発生数値 */
    /* PWMのキャリア周期になる */
    /*=================================================================*/
                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    PR4 = 0xFFU;            /*  1 1 1 1  -  1 1 1 1                    */   /* 最大カウントで一致割り込み発生させる */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*=================================================================*/
}


/**************************************************************/
/*  Function:                                                 */
/*  タイマ0初期設定                                            */
/*  メインタスクの時間管理用につかう                             */
/**************************************************************/
static void func_mset_s_timer6_setup( void )
{
    /* 対応するCCPモジュール:CCP3 */
    /* タイマ6の設定 */
    /* ※一致割り込みを使用するだけなら、CCPの設定はいらない */
    /* タイマレジスタ初期化 */
    /*=================================================================*/
                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    TMR6 = 0xFFU;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/
    

    /* タイマ4初期設定 */
    /*====================================================================*/
                            /*  +------------------------- 7 : -          */
                            /*  | +----------------------- 6 : TxOUTPS<3> */
                            /*  | | +--------------------- 5 : TxOUTPS<2> */
                            /*  | | | +------------------- 4 : TxOUTPS<1> */
                            /*  | | | |                                   */
                            /*  | | | |     +------------- 3 : TxOUTPS<0> */
                            /*  | | | |     | +----------- 2 : TMRxON     */    /* タイマ2動作 許可 */
                            /*  | | | |     | | +--------- 1 : TxCKPS<1>  */    /* タイマ2 プリスケーラ：11 -> 1/64 */
                            /*  | | | |     | | | + ------ 0 : TxCKPS<0>  */
    T6CON = 0x07U;          /*  0 0 0 0  -  0 1 1 1                       */
    /*--------------------------------------------------------------------*/
    /* memo                                                               */
    /* クロック:16MHz                                                      */
    /* ペリフェラルクロック：Fosc/4 = 4MHz                                  */
    /* プリスケーラ：1/64 -> 62,500Hz                                      */
    /* 一致カウント数(キャリア周期カウントPRx)設定：255 -> 12,500/(255+1) = 244.14...Hz -> 4.096...ms */
    /*====================================================================*/


    /* タイマ4 一致割り込み発生数値 */
    /* PWMのキャリア周期になる */
    /*=================================================================*/
                            /*  +------------------------- 7 :         */
                            /*  | +----------------------- 6 :         */
                            /*  | | +--------------------- 5 :         */
                            /*  | | | +------------------- 4 :         */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 :         */
                            /*  | | | |     | +----------- 2 :         */
                            /*  | | | |     | | +--------- 1 :         */
                            /*  | | | |     | | | + ------ 0 :         */
    PR6 = 0xFFU;            /*  1 1 1 1  -  1 1 1 1                    */   /* 最大カウントで一致割り込み発生させる */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*=================================================================*/
}

/* テンプレート */
/*=========================================================*/

                        /*  +------------------------- 7 : */
                        /*  | +----------------------- 6 : */
                        /*  | | +--------------------- 5 : */
                        /*  | | | +------------------- 4 : */
                        /*  | | | |                        */
                        /*  | | | |     +------------- 3 : */
                        /*  | | | |     | +----------- 2 : */
                        /*  | | | |     | | +--------- 1 : */
                        /*  | | | |     | | | + ------ 0 : */
    /*  0 0 0 0  -  0 0 1 1            */
/*-----------------------------------------------------------------*/
/* memo                                                            */
/*                                                                 */
/*=================================================================*/


